-- +goose Up
-- +goose StatementBegin
INSERT INTO interests (name) VALUES
                                 ('Разработка программного обеспечения'),
                                 ('Веб-разработка'),
                                 ('Мобильная разработка'),
                                 ('Искусственный интеллект'),
                                 ('Машинное обучение'),
                                 ('Анализ данных'),
                                 ('Кибербезопасность'),
                                 ('Администрирование баз данных'),
                                 ('Облачные вычисления'),
                                 ('Интернет вещей (IoT)'),
                                 ('Разработка игр'),
                                 ('Разработка интерфейсов (UI/UX)'),
                                 ('Управление проектами в IT'),
                                 ('DevOps'),
                                 ('Контейнеризация (Docker, Kubernetes)'),
                                 ('Виртуализация'),
                                 ('Сетевые технологии'),
                                 ('Автоматизация процессов'),
                                 ('Разработка API'),
                                 ('Тестирование программного обеспечения'),
                                 ('Архитектура ПО'),
                                 ('Робототехника'),
                                 ('Виртуальная и дополненная реальность (VR/AR)'),
                                 ('Фронтенд-разработка'),
                                 ('Бэкенд-разработка'),
                                 ('Разработка на Python'),
                                 ('Разработка на Java'),
                                 ('Разработка на JavaScript'),
                                 ('Разработка на Go'),
                                 ('Финансовые технологии (FinTech)'),
                                 ('Блокчейн и криптовалюты'),
                                 ('Графический дизайн'),
                                 ('Веб-дизайн'),
                                 ('Дизайн пользовательского опыта (UX)'),
                                 ('Дизайн пользовательских интерфейсов (UI)'),
                                 ('Маркетинговая аналитика'),
                                 ('Социальные медиа маркетинг'),
                                 ('Контент-маркетинг'),
                                 ('Email-маркетинг'),
                                 ('HR-аналитика');
-- +goose StatementEnd

-- +goose Down
-- +goose StatementBegin
-- +goose StatementEnd
